public class Test023 {
	public static void main(String[] args) {
		char i = 'A';
		int j = i;
			
		System.out.println(i);
		System.out.println(j);
	}
	
}


/*
	char
	¹®ÀÚ ÇÏ³ª¸¦ ''·Î °¨½Ñ °ªÀ» ´ëÀÔÇÒ ¼ö ÀÖ´Â º¯¼ö¸¦ »ı¼ºÇÏ´Â ÀÚ·áÇü
	
	char´Â intÇüÀ¸·Î ÀÚµ¿ Çüº¯È¯ °¡´ÉÇÏ´Ù.  char < int
	
	ASCII ÄÚµå
	ÄÄÇ»ÅÍ´Â 0 ¶Ç´Â 1 : ¼ıÀÚ´Â ¾î¶»°Ôµç µÇ´Âµ¥ ¹®ÀÚ´Â? ¹®ÀÚ ÇÏ³ª¿¡ ¼ıÀÚ¸¦ ºÎ¿©ÇÏ¿© ¸Ş¸ğ¸®¿¡ ÀúÀåÇÏÀÚ.
	
	¹®ÀÚ ÇÏ³ª¸¦ ¾î¶² ¼ıÀÚ¿¡ ¸ÅÄª½ÃÅ³ °ÍÀÎ°¡¸¦ Á¤ÇÑ Ç¥ÁØÀÌ ¾Æ½ºÅ°ÄÚµåÀÌ´Ù.
	
	charÇü º¯¼ö¿¡ ÀúÀåµÇ´Â °Ç ¹®ÀÚ ±× ÀÚÃ¼°¡ ¾Æ´Ï¶ó ¾Æ½ºÅ° ÄÚµå¿¡ ±Ù°ÅÇÑ ¹®ÀÚ¿¡ ÇØ´çÇÏ´Â ¼ıÀÚ°ª
	(±×·¯´Ï intÇüÀ¸·Î ÀÚµ¿Çüº¯È¯ÀÌ °¡´ÉÇÔ)
	
	¹®Á¦´Â ¾Æ½ºÅ° ÄÚµå´Â 7ºñÆ® Áï 0~127ÀÇ ¹®ÀÚ¸¸ ÁöÁ¤ÀÌ °¡´ÉÇÔ.(1¹ÙÀÌÆ®¸¸ ¾²±â·Î ¾à¼ÓµÊ)
	
	Áï ¹ÙÀÌÆ®¸¦ µÎ °³ ºÙ¿©¼­ ¹®ÀÚ ÇÏ³ª¸¦ Ç¥ÇöÇÏ´Â ¹æ¹ıÀ¸·Î °¥ ¼ö ¹Û¿¡ ¾ø´Ù.
	
	¿µ¾î µÎ ±ÛÀÚ Ç¥±âÇÒ ¼ö ÀÖ´Â ±â¾ï°ø°£À» ¿ì¸®´Â ÇÑ ±ÛÀÚ¸¦ Ç¥ÇöÇÏ±â À§ÇØ »ç¿ëÇÏÀÚ.
	
	java ÀÇ char ´Â 2¹ÙÀÌÆ® Å©±â¸¦ °¡Áö°í , À¯´ÏÄÚµå¸¦ Áö¿øÇÑ´Ù!! ÇÑ±Û ÇÑ¹® ÀÏº»¾î Áß±¹¾î ... 
	
	Web ÀÌ »ı±â¸é¼­ ¹®Á¦°¡ »ı°å´Ù. È¨ÆäÀÌÁö ¿­Ç³ ... ”?°°Àº ¹®ÀÚ°¡ À¯´ÏÄÚµå¿¡¼­ ¾È¸ÔÈ÷´õ¶ó ...
	À¯´ÏÄÚµå¿Í È£È¯µÇ¸é¼­ È®Àå¼ºÀ» °¡Áö´Â »õ·Î¿î ¹®ÀÚÃ¼Á¦°¡ ÇÊ¿äÇÏ´õ¶ó -> UTF-8 ÄÚµåÃ¼°è
	
	UTF-8 Àº °¡º¯±æÀÌ¸¦ Ã¤¿ëÇß´Ù ( ÃÖ¼Ò 1 ~ 4¹ÙÀÌÆ® ±îÁö¸¦ Áö¿ø ) : ±âÁ¸ÀÇ ¹®ÀÚ¸¦ ¾ø¾ÖÁö ¾Ê°í Ãß°¡ °¡´É
	"java ÀÇ char ´Â À¯´ÏÄÚµå¸¦ ¾²Áö¸¸ À¥ÀÇ Ç¥ÁØÀº UTF-8 À» »ç¿ëÇÑ´Ù"
	: ÇØ¼­ ³ªÁß¿¡ ÀÚ¹Ù·Î À¥ ÇÁ·Î±×·¡¹Ö ÇÒ ¶§´Â ¹®ÀÚ¿­ÀÇ ÀÎÄÚµù ¹æ½ÄÀ» UTF-8 ·Î ¹Ù²Ù¾î¼­ »ç¿ëÇØ¾ß ÇÑ´Ù

	
*/